#ifndef SETTINGDIALOG_H
#define SETTINGDIALOG_H

/************************************************************************
描述： 设置界面
作者： WANGXL
时间： 2018-12-24
************************************************************************/

#include <QDialog>
#include <QPushButton>
#include <QTreeWidgetItem>
#include <QListView>
#include <QColorDialog>
#include <QTableWidget>
#include "datamodel.h"
#include "titlebar.h"


#pragma execution_character_set("utf-8")
namespace Ui {
class SettingDialog;
}

class SettingDialog : public QDialog
{
    Q_OBJECT

public:
    ~SettingDialog();
    /***************************************************************************
    *功能：获取实例
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    static SettingDialog* getInstance(QWidget *parent = nullptr);

    void initMyTitle();

    /***************************************************************************
    *功能：新增告警配置参数
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void addAlarmConfig();

    /***************************************************************************
    *功能：修改告警配置参数
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void modifyAlarmConfig(stAlarmConfig alarmConfig);

    /***************************************************************************
    *功能：获取告警配置设置结果
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    stAlarmConfig getAlarmConfigSetResult();

    /***************************************************************************
    *功能：路由参数设置
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    void routeParamSet(RouteConf_Info info);
    /***************************************************************************
    *功能：获取路由参数设置结果
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    RouteConf_Info getRouteParamSetResult();

    /***************************************************************************
    *功能：子接口参数设置
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    void subnetParamSet(Subnet_Info info, bool flag = true);
    /***************************************************************************
    *功能：获取子接口参数设置结果
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    Subnet_Info getSubnetParamResult();

    /***************************************************************************
    *功能：新增角色信息
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    void addRoleInfo(QMap<QString, QMap<QString, RoleMenu_Info> > roleMenuFuncInfoMap);
    /***************************************************************************
    *功能：修改角色信息
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    void modifyRoleInfo(Role_Info info, QMap<QString, RoleMenu_Info> funcInfoMap);

    /***************************************************************************
    *功能：获取角色配置结果
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    Role_Info getRoleInfoResult();
    /***************************************************************************
    *功能：获取角色功能的读写权限
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    QMap<QString, RoleMenu_Info> getRoleMenuFuncResult();

    /***************************************************************************
    *功能：设置所有的功能菜单
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    void setAllMenuFuncInfoMap(QMultiMap<QString, MenuFunc_Info> allMenuFuncInfoMap);
    /***************************************************************************
    *功能：菜单排序
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    void menuFuncSort(QList<MenuFunc_Info> &infoList);

    /***************************************************************************
    *功能：展示功能菜单树
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    void showMenuFuncTree(QString parentId, QTreeWidgetItem* parentItem);

    /***************************************************************************
    *功能：清除功能菜单树
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    void clearMenuFuncTree();

    /***************************************************************************
    *功能：更新树节点的选择状态
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    void updateTreeItemCheckState();

    /***************************************************************************
    *功能：更新父节点状态
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    void updateParentItemCheckState(QTreeWidgetItem* item, int column);

    /***************************************************************************
    *功能：更新子节点状态
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    void updateSubItemCheckState(QTreeWidgetItem* item, int column);

    /***************************************************************************
    *功能：新增用户
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    void addUserInfo(QMap<QString, Role_Info> allRoleInfoMap);
    /***************************************************************************
    *功能：修改用户
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    void modifyUserInfo(User_Info info);

    /***************************************************************************
    *功能：获取用户配置结果
    *输入：无
    *输出：无
    *时间：2019-01-08
    *作者：WANGXL
    ***************************************************************************/
    User_Info getUserConfResult();

    /***************************************************************************
    *功能：用户密码修改
    *输入：无
    *输出：无
    *时间：2019-01-15
    *作者：WANGXL
    ***************************************************************************/
    void modifyUserPwd(QString name, bool flag = true);

    /***************************************************************************
    *功能：获取修改密码结果
    *输入：无
    *输出：无
    *时间：2019-01-15
    *作者：WANGXL
    ***************************************************************************/
    QStringList getModifyUserPwdResult();

    /***************************************************************************
    *功能：设置登录地址
    *输入：无
    *输出：无
    *时间：2019-01-15
    *作者：WANGXL
    ***************************************************************************/
    void setLoginAddr();

    /***************************************************************************
    *功能：获取登录地址
    *输入：无
    *输出：无
    *时间：2019-01-15
    *作者：WANGXL
    ***************************************************************************/
    QString getLoginAddr();

    /***************************************************************************
    *功能：身份信息校验
    *输入：userName:用户名
    *输出：无
    *时间：2019-01-15
    *作者：WANGXL
    ***************************************************************************/
    void setPasswordConfirm(QString userName);

    /***************************************************************************
    *功能：获取身份校验结果
    *输入：无
    *输出：无
    *时间：2019-01-15
    *作者：WANGXL
    ***************************************************************************/
    User_Info getPasswordConfirmResult();

    /***************************************************************************
    *功能：新增主站参数配置
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void addMainStationInfo();

    /***************************************************************************
    *功能：修改主站参数配置
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void modifyMainStationInfo(MainStation_Info info);

    /***************************************************************************
    *功能：获取主站参数配置结果
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    MainStation_Info getMainStationInfoResult();

    /***************************************************************************
    *功能：初始化表格
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    void initTable(QTableWidget* tableWidget);

    /***************************************************************************
    *功能：表格添加一行
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    void addRowOnTable(QTableWidget* tableWidget, Asset_Info assetInfo);

    /***************************************************************************
    *功能：资产选择
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void assetSelect(QMap<QString, Asset_Info> assetInfoMap);

    /***************************************************************************
    *功能：获取资产选择结果
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    QStringList getAssetSelectResult();

    /***************************************************************************
    *功能：添加snmp配置
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void addSnmpConfig();

    /***************************************************************************
    *功能：修改snmp配置
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void modifySnmpConfig(Snmp_Info info);

    /***************************************************************************
    *功能：获取snmp配置结果
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    Snmp_Info getSnmpConfigResult();

    /***************************************************************************
    *功能：添加事件解析字段
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void addResolveFieldConfig();

    /***************************************************************************
    *功能：修改事件解析字段
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void modifyResolveFieldConfig(Resolve_FieldInfo info);

    /***************************************************************************
    *功能：获取事件解析字段配置结果
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    Resolve_FieldInfo getResolveFieldConfigResult();

    /***************************************************************************
    *功能：初始化端口详情展示表格
    *输入：无
    *输出：无
    *时间：2018-12-24
    *作者：WANGXL
    ***************************************************************************/
    void initPortTable(QTableWidget* tableWidget);

    /***************************************************************************
    *功能：端口详情表添加一行
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void addRowOnPortTable(QTableWidget* tableWidget, QString portStr, QString protocolStr, QString serverStr);

    /***************************************************************************
    *功能：端口详情展示
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void portDetailDisplay(QString detail);

    /***************************************************************************
    *功能：重置用户密码
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    void resetUserPwd(QString userName);

    /***************************************************************************
    *功能：获取重置用户名称
    *输入：无
    *输出：无
    *时间：2019-01-23
    *作者：WANGXL
    ***************************************************************************/
    QString getResetUserName();
private slots:
    void on_lineEdit_vlanid_3_textChanged(const QString &arg1); //vlanid输入框变化
    void on_comboBox_roleType_4_currentIndexChanged(int index); //角色类型选择框变化
    void on_treeWidget_4_itemClicked(QTreeWidgetItem *item, int column); //树节点点击

    void slot_modifyAlarmColor();
protected:
    bool eventFilter(QObject *obj, QEvent *evt);

private:
    explicit SettingDialog(QWidget *parent = nullptr);
private:
    Ui::SettingDialog *ui;
    static SettingDialog* m_instance;
    QMultiMap<QString, MenuFunc_Info> m_allMenuFuncInfoMap; //功能菜单<父节点唯一标识，功能>
    QMap<QString, QMap<QString, RoleMenu_Info> > m_roleMenuFuncInfoMap; //角色功能菜单<角色ID,<功能ID，读写标志>>
    QMap<QString, RoleMenu_Info> m_curFuncMenuMap; //当前的功能菜单
    bool m_dispAllTreeItemFlag; //显示所有的树节点，即不可读的也显示

    QMap<int, Role_Info> m_comboxRoleInfoMap; //<选择框序号，角色信息>

    TitleBar *m_titleBar;
};

#endif // SETTINGDIALOG_H
